<?php
ob_start();
?>
<h1>Принципы Дискурса</h1>

<content>

    <div align="center"><i>Список не является полным и будет постоянно дополняться и корректироваться.</i></div>
    <br>
    <b>Дискурс</b> — анонимный форум, работающий в интересах своих пользователей. Целью существования Дискурса является посторение комфортной среды для анонимного общения.<br>
    <br> Для конкретизации задач разработки был выработан ряд принципов, которые приведены ниже.

    <h2>Принцип свободы слова</h2>
    На Дискурсе приветствуется свобода слова. Ни одно мнение не может быть признано единственно верным.<br>
    <br>
    Тем не менее, постинг определенного контента усложняет общение пользователей, мешает работе форума, засоряет информационный поток.<br>
    <br>
    В связи с этим на Дискурсе запрещено слеующее:<br>
    <br>
    <ol>
      <li><b>Порнография и шок-контент.</b> На данный момент запрещены на всей борде, в будущем возможно появятся специальные разделы для этой тематики.</li>
      <li><b>Спам.</b> В том числе пиар имиджборд. Единичные сообщения будут удаляться, в случае рецидивов авторы попадают в бан. Если вы хотите попиариться, сделать это можно в <a href="https://discou.rs/topic/1152" target="_blank">специальной теме</a>.</li>
      <li><b>Вайп.</b> Большое количество (>3) одинаковых и/или бессмысленных сообщений.</li>
    </ol>
    <br>
    Всё остальное постить можно. И нужно!
  
    <h2>Принцип меритократии</h2>
    Управление Дискурсом делегируется наиболее достойным участникам, то есть тем, кто делает что-то полезное для форума и участвует в его развитии. Меритократия предполагает выступление с предложениями и голосование с целью их одобрения или отклонения.

    <h2>Принцип демонополизации</h2>
    Дискурс является открытой средой для разработчиков, которые свободны предлагать свои технологические решения. Разные технологии от разных разработчиков могут применяться одновременно друг с другом.

    <h2>Принцип анонимности</h2>
    Дискурс создается как площадка для анонимного общения, тем не менее, допускается и неанонимный постинг. Анонимность не может быть принудительной (кроме отдельных случаев), равно как и недопустим запрет публикации материалов под псевдонимом. Анонимные и неанонимные пользователи равны в своих правах и обязанностях.

    <h2>Принцип приватности</h2>
    Администрация Дискурса делает всё от нее зависящее чтобы избежать деанонимизации (раскрытия реальной личности, IP-адреса) пользователей, в том числе и постящих под псевдонимом. Пользователи Дискурса должны быть уверены, что Дискурс — безопасное место для обмена идеями, что они не подвергнутся преследованиям из-за использования Дискурса.

    <h2>Принцип кооперации</h2>
    Администрация и команда Дискурса делает всё возможное для установления дружеских связей и сотрудничества с другими ресурсами, действующими в интересах защиты свободы в интернете. Кооперация пользователей Дискурса и администрации в целях защиты их интересов и развития проекта приветствуется.

    <h2>Принцип инновационности</h2>
    Для успешного развития проекта необходимо идти в ногу со временем и применять самые передовые технологические решения. Технологии, на которых работают современные имиджборды, давно устарели. Это не позволяет имиджбордам привлекать новую аудиторию, в результате чего русскоязычное анонимное сообщество ухудшается год от года через отрицательную селекцию.

    <h2>Принцип экспансии</h2>
    Администрация и команда Дискурса придерживается мнения, что право на комфортную анонимную среду является неотъемлемым для каждого человека. Недопустимо разделение пользователей на «своих» и «чужих», «ньюфагов» и «олдфагов», «быдло» и «небыдло». Для успешного развития проекта необходимо постоянное привлечение новых пользователей из разных источников.

    <h2>Принцип самообеспечения</h2>
    Для того, чтобы не приходилось жить за счет продажи пасскодов или хостить Дискурс на серверах mail.ru, необходимо зарабатывать собственные средства. Очевидно, что проект не сможет существовать за счет пожертвований. Количество трафика на одного пользователя у Википедии в десятки раз меньше, чем у анонимного форума, и даже ей с большим трудом удается собирать достаточно средств для существования.

    <h2>Принцип дружелюбности</h2>
    Дискурс не должен ассоциироваться с ненавистью, насилием, извращениями и цинизмом, так как это ставит крест на любых перспективых развития проекта. Предполагается принятие правил поведения, аналогичных правилам крупных интернет-ресурсов. Тем не менее, не исключено создание «особых разделов», в которых будет разрешена какая-то часть «недружелюбного» контента.

    <h2>Принцип долговечности</h2>
    Дискуссии на Дискурсе ведутся «для вечности», а не до момента удаления треда. Прикладываются все усилия, чтобы старый контент не удалялся, а оставался на серверах.

    <h2>Принцип благодарности</h2>
    Администрация и пользователи Дискурса благодарны тем, кто участвовал в развитии проекта. В связи с этим создается реестр благодарственных писем особо отличившимся участникам.

    <h2>Принцип прозрачности</h2>
    Администрация ставит целью сделать Дискурс как можно более прозрачным, упростить процесс принятия решений и публиковать исходный код.
</content>
<?php
$html = ob_get_contents();
ob_end_clean();

$twig_data = array
(
  "html" => $html
);

echo render($twig_data);
?>